In [1]:
!pwd

/Users/AdelAlsagoff/DSI/materials copy/1.07-lesson-continuous-distributions

In [2]:
cd DSI

[Errno 2] No such file or directory: 'DSI'
/Users/AdelAlsagoff/DSI/materials copy/1.07-lesson-continuous-distributions

In [3]:
%cd '/Users/AdelAlsagoff/DSI'

/Users/AdelAlsagoff/DSI

In [4]:
!ls

first_DSI21.ipynb lab               materials         materials copy

In [5]:
cd materials

/Users/AdelAlsagoff/DSI/materials

In [6]:
ls

1.01-lesson-python-intro/             1_01-lab-pokemon/
1.02-lesson-python-control-flow/      1_02-lab-distributions/
1.03-lesson-python-functions/         2.01-2.02-intro-to-pandas/
1.04-lesson-list-comprehension/       CheatSheets/
1.05-lesson-intro_to_probability/     OtherNotes/
1.06-lesson-discrete-distributions/   README.md
1.07-lesson-continuous-distributions/ project_1/
1.08-lesson-central-limit-theorem/

In [7]:
cd project_1

/Users/AdelAlsagoff/DSI/materials/project_1

In [8]:
ls

README.md  code/      data/

In [9]:
cd data

/Users/AdelAlsagoff/DSI/materials/project_1/data

In [10]:
;s

NameError: name 's' is not defined

In [11]:
ls

act_2017.csv                            sat_2018.csv
act_2018.csv                            sat_2019.csv
act_2019.csv                            sat_2019_by_intended_college_major.csv
act_2019_ca.csv                         sat_2019_ca.csv
sat_2017.csv                            sat_act_by_college.csv

In [12]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [13]:
act_17 = pd.read_csv('act_2017.csv')

In [15]:
act_17.head()

      State Participation  English  Math  Reading  Science Composite
0  National           60%     20.3  20.7     21.4     21.0      21.0
1   Alabama          100%     18.9  18.4     19.7     19.4      19.2
2    Alaska           65%     18.7  19.8     20.4     19.9      19.8
3   Arizona           62%     18.6  19.8     20.1     19.8      19.7
4  Arkansas          100%     18.9  19.0     19.7     19.5      19.4

In [16]:
act_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          52 non-null     object
 1   Participation  52 non-null     object
 2   English        52 non-null     float64
 3   Math           52 non-null     float64
 4   Reading        52 non-null     float64
 5   Science        52 non-null     float64
 6   Composite      52 non-null     object
dtypes: float64(4), object(3)
memory usage: 3.0+ KB

In [17]:
!ls

act_2017.csv                           sat_2018.csv
act_2018.csv                           sat_2019.csv
act_2019.csv                           sat_2019_by_intended_college_major.csv
act_2019_ca.csv                        sat_2019_ca.csv
sat_2017.csv                           sat_act_by_college.csv

In [18]:
sat_17 = pd.read_csv('sat_2017.csv')

In [19]:
sat_17.head()

        State Participation  Evidence-Based Reading and Writing  Math  Total
0     Alabama            5%                                 593   572   1165
1      Alaska           38%                                 547   533   1080
2     Arizona           30%                                 563   553   1116
3    Arkansas            3%                                 614   594   1208
4  California           53%                                 531   524   1055

In [20]:
sat_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   State                               51 non-null     object
 1   Participation                       51 non-null     object
 2   Evidence-Based Reading and Writing  51 non-null     int64
 3   Math                                51 non-null     int64
 4   Total                               51 non-null     int64
dtypes: int64(3), object(2)
memory usage: 2.1+ KB

In [25]:
datasets = [sat_17,act_17]

[x.info() for x in datasets]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   State                               51 non-null     object
 1   Participation                       51 non-null     object
 2   Evidence-Based Reading and Writing  51 non-null     int64
 3   Math                                51 non-null     int64
 4   Total                               51 non-null     int64
dtypes: int64(3), object(2)
memory usage: 2.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          52 non-null     object
 1   Participation  52 non-null     object
 2   English        52 non-null     float64
 3   Math           52 non-null     float64
 4   Reading        52 non-null     float64
 5   Science        52 non-null     float64
 6   Composite      52 non-null     object
dtypes: float64(4), object(3)
memory usage: 3.0+ KB

[None, None]

In [29]:
sat_17_states = list(set(sat_17['State'])) #extra state

In [30]:
act_17_states = list(set(act_17['State']))

In [114]:
[print(f'extra state in act_17, {x}') for x in act_17_states if x not in sat_17_states]

extra state in act_17, National

[None]

In [50]:
act_18 = pd.read_csv('act_2018.csv')
sat_18 = pd.read_csv('sat_2018.csv')
act_19 = pd.read_csv('act_2019.csv')
sat_19 = pd.read_csv('sat_2019.csv')

In [51]:
act_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          52 non-null     object
 1   Participation  52 non-null     object
 2   Composite      52 non-null     float64
dtypes: float64(1), object(2)
memory usage: 1.3+ KB

In [52]:
act_18.shape

(52, 3)

In [49]:
act_17.shape

(52, 7)

In [55]:
act_19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          52 non-null     object
 1   Participation  52 non-null     object
 2   Composite      52 non-null     float64
dtypes: float64(1), object(2)
memory usage: 1.3+ KB

In [56]:
sat_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   State                               51 non-null     object
 1   Participation                       51 non-null     object
 2   Evidence-Based Reading and Writing  51 non-null     int64
 3   Math                                51 non-null     int64
 4   Total                               51 non-null     int64
dtypes: int64(3), object(2)
memory usage: 2.1+ KB

In [57]:
sat_18.shape

(51, 5)

In [58]:
sat_19.shape

(53, 5)

In [60]:
sat_19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53 entries, 0 to 52
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               53 non-null     object
 1   Participation Rate  53 non-null     object
 2   EBRW                53 non-null     int64
 3   Math                53 non-null     int64
 4   Total               53 non-null     int64
dtypes: int64(3), object(2)
memory usage: 2.2+ KB

In [64]:
sat_19_states = list(set(sat_19['State']))

In [66]:
len(sat_19_states)

53

In [69]:
[print(f'extra state, {x}') for x in sat_19_states if x not in sat_17_states]

extra state, Virgin Islands
extra state, Puerto Rico

[None, None]

In [70]:
!ls

act_2017.csv                           sat_2018.csv
act_2018.csv                           sat_2019.csv
act_2019.csv                           sat_2019_by_intended_college_major.csv
act_2019_ca.csv                        sat_2019_ca.csv
sat_2017.csv                           sat_act_by_college.csv

Findings:

ACT 17-19 have the same number of rows but different columns as well as spelling for the overlapping ones
ACT 17-19 also has National average


SAT 19 has additional states Virgin Island and Puerto Rico
SAT 17-19 different number of columns as well as spelling for the overlapping ones

In [73]:
sat_18.head()

        State Participation  Evidence-Based Reading and Writing  Math  Total
0     Alabama            6%                                 595   571   1166
1      Alaska           43%                                 562   544   1106
2     Arizona           29%                                 577   572   1149
3    Arkansas            5%                                 592   576   1169
4  California           60%                                 540   536   1076

In [86]:
sat_18.columns = [col.replace(' ','_') and col.lower() for col in sat_18.columns]

In [91]:
sat_18.head()

        state participation  evidence-based_reading_and_writing  math  total
0     Alabama            6%                                 595   571   1166
1      Alaska           43%                                 562   544   1106
2     Arizona           29%                                 577   572   1149
3    Arkansas            5%                                 592   576   1169
4  California           60%                                 540   536   1076

In [96]:
sat_18.loc[(sat_18.state == 'National')]

Empty DataFrame
Columns: [state, participation, evidence-based_reading_and_writing, math, total]
Index: []

In [98]:
sat_18_states = [x for x in sat_18['state']]

In [100]:
sat_18_states

['Alabama',
 'Alaska',
 'Arizona',
 'Arkansas',
 'California',
 'Colorado',
 'Connecticut',
 'Delaware',
 'District of Columbia',
 'Florida',
 'Georgia',
 'Hawaii',
 'Idaho',
 'Illinois',
 'Indiana',
 'Iowa',
 'Kansas',
 'Kentucky',
 'Louisiana',
 'Maine',
 'Maryland',
 'Massachusetts',
 'Michigan',
 'Minnesota',
 'Mississippi',
 'Missouri',
 'Montana',
 'Nebraska',
 'Nevada',
 'New Hampshire',
 'New Jersey',
 'New Mexico',
 'New York',
 'North Carolina',
 'North Dakota',
 'Oklahoma',
 'Ohio',
 'Oregon',
 'Pennsylvania',
 'Rhode Island',
 'South Carolina',
 'South Dakota',
 'Tennessee',
 'Texas',
 'Utah',
 'Vermont',
 'Virginia',
 'Washington',
 'West Virginia',
 'Wisconsin',
 'Wyoming']

In [101]:
[print(f'extra state, {x}') for x in sat_18_states if x not in sat_17_states]

[]

In [103]:
len(sat_18)

51

In [104]:
len(sat_17)

51

In [105]:
len(sat_19)

53

In [116]:
(act_17['State'] == 'National') == True

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
51    False
Name: State, dtype: bool

In [113]:
act_17['State']

0                 National
1                  Alabama
2                   Alaska
3                  Arizona
4                 Arkansas
5               California
6                 Colorado
7              Connecticut
8                 Delaware
9     District of Columbia
10                 Florida
11                 Georgia
12                  Hawaii
13                   Idaho
14                Illinois
15                 Indiana
16                    Iowa
17                  Kansas
18                Kentucky
19               Louisiana
20                   Maine
21                Maryland
22           Massachusetts
23                Michigan
24               Minnesota
25             Mississippi
26                Missouri
27                 Montana
28                Nebraska
29                  Nevada
30           New Hampshire
31              New Jersey
32              New Mexico
33                New York
34          North Carolina
35            North Dakota
36                    Ohio
37                Oklahoma
38                  Oregon
39            Pennsylvania
40            Rhode Island
41          South Carolina
42            South Dakota
43               Tennessee
44                   Texas
45                    Utah
46                 Vermont
47                Virginia
48              Washington
49           West Virginia
50               Wisconsin
51                 Wyoming
Name: State, dtype: object

Findings:

ACT 17-19 have the same number of rows but different columns as well as spelling for the overlapping ones<br> 
ACT 17 also has National average<br>

ACT 17 row 51, Composite score is not a float<br>

ACT 18, bottom 3 states in Composite score have 100% participation: Nevada, South Carolina, Missippi


SAT 19 has additional states Virgin Island and Puerto Rico

SAT 17-19 different number of columns as well as spelling for the overlapping ones

In [117]:
act_17['State'].head()

0    National
1     Alabama
2      Alaska
3     Arizona
4    Arkansas
Name: State, dtype: object

In [121]:

act_17.sort_values('State',ascending=False).head(3)

            State Participation  English  Math  Reading  Science Composite
51        Wyoming          100%     19.4  19.8     20.8     20.6     20.2x
50      Wisconsin          100%     19.7  20.4     20.6     20.9      20.5
49  West Virginia           69%     20.0  19.4     21.2     20.5      20.4

In [132]:
act_17.loc[0,'Composite'] = 21.0

In [133]:
act_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          52 non-null     object
 1   Participation  52 non-null     object
 2   English        52 non-null     float64
 3   Math           52 non-null     float64
 4   Reading        52 non-null     float64
 5   Science        52 non-null     float64
 6   Composite      52 non-null     object
dtypes: float64(4), object(3)
memory usage: 3.0+ KB

In [146]:
type(act_17.loc[1,'Composite'])

str

In [175]:
for i in range(len(act_17)):
    try:
        act_17.loc[i,'Composite'] = float(act_17.loc[i,'Composite'])
    except:
        print (act_17.Composite[i],i)

In [173]:
act_17.loc[51,'Composite'] = 20.2

In [162]:
type(act_17.loc[1,'Composite'])

float

In [163]:
act_17.Composite[1]

19.2

In [170]:
act_17.loc[1,'Composite'] = '19.2'

In [171]:
act_17.loc[1,'Composite']

'19.2'

In [176]:
act_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          52 non-null     object
 1   Participation  52 non-null     object
 2   English        52 non-null     float64
 3   Math           52 non-null     float64
 4   Reading        52 non-null     float64
 5   Science        52 non-null     float64
 6   Composite      52 non-null     object
dtypes: float64(4), object(3)
memory usage: 3.0+ KB

In [178]:
type(act_17['Composite'][0])

float

In [179]:
act_17['Composite'].mean()

21.509615384615383

In [182]:
act_17.loc[act_17.State == 'National']

      State Participation  English  Math  Reading  Science Composite
0  National           60%     20.3  20.7     21.4     21.0        21

In [185]:
[print(x) for x in act_18_tate not in act_17]

TypeError: 'Series' objects are mutable, thus they cannot be hashed

In [191]:
act_18.sort_values('Composite',ascending=True).head(5)

             State Participation  Composite
29          Nevada          100%       17.7
41  South Carolina          100%       18.3
25     Mississippi          100%       18.6
11          Hawaii           89%       18.9
34  North Carolina          100%       19.1

Findings:

ACT 17-19 have the same number of rows but different columns as well as spelling for the overlapping ones<br> 
ACT 17 also has National average<br>

ACT 17 row 51, Composite score is not a float<br>

ACT 17-18, bottom 3 states in Composite score have 100% participation: Nevada, South Carolina, Missippi<br>
ACT 19, bottom 3 states in Composite score have 100% participation: Nevada, Louisiana, Missippi


SAT 19 has additional states Virgin Island and Puerto Rico

SAT 17-19 different number of columns as well as spelling for the overlapping ones

SAT 17 bottom 3 states are Idaho, Delaware, and District Columbia. Idaho has 93% Participation whilst the other 2 states are 100%.<br>
SAT 18 bottom 3 state Distric Columbia (92%), Delaware (100%) and West Virginia (28%).<br>
SAT 19 bottom 5 includes the 2 additional states without participation rates. West Viriginia (99%), Oklahoma (22%) and District of Columbia (94%)<br>

Intended CLG MJR with top 5 average total score was less than 5 percent in terms of overall test takers per each major<br>
Test Taker column not integer.

In [192]:
act_17.sort_values('Composite',ascending=True).head(5)

             State Participation  English  Math  Reading  Science Composite
29          Nevada          100%     16.3  18.0     18.1     18.2      17.8
25     Mississippi          100%     18.2  18.1     18.8     18.8      18.6
41  South Carolina          100%     17.5  18.6     19.1     18.9      18.7
12          Hawaii           90%     17.8  19.2     19.2     19.3        19
34  North Carolina          100%     17.8  19.3     19.6     19.3      19.1

In [193]:
act_19.sort_values('Composite',ascending=True).head(3)

          State Participation  Composite
28       Nevada          100%       17.9
24  Mississippi          100%       18.4
18    Louisiana          100%       18.8

In [194]:
sat_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   State                               51 non-null     object
 1   Participation                       51 non-null     object
 2   Evidence-Based Reading and Writing  51 non-null     int64
 3   Math                                51 non-null     int64
 4   Total                               51 non-null     int64
dtypes: int64(3), object(2)
memory usage: 2.1+ KB

In [196]:
sat_17.sort_values('Total',ascending=True).head(3)

,State,Participation,Evidence-Based Reading and Writing,Math,Total
8,District of Columbia,100%,482,468,950
7,Delaware,100%,503,492,996
12,Idaho,93%,513,493,1005

In [198]:
sat_18.sort_values('total',ascending=True).head(3)

,state,participation,evidence-based_reading_and_writing,math,total
8,District of Columbia,92%,497,480,977
7,Delaware,100%,505,492,998
48,West Virginia,28%,513,486,999

In [204]:
sat_19.sort_values('Total',ascending=True).head(5)

                   State Participation Rate  EBRW  Math  Total
47        Virgin Islands                  —   490   445    935
50         West Virginia                99%   483   460    943
39           Puerto Rico                  —   483   462    944
36              Oklahoma                22%   490   472    963
8   District of Columbia                94%   495   480    975

In [205]:
!ls

act_2017.csv                           sat_2018.csv
act_2018.csv                           sat_2019.csv
act_2019.csv                           sat_2019_by_intended_college_major.csv
act_2019_ca.csv                        sat_2019_ca.csv
sat_2017.csv                           sat_act_by_college.csv

In [207]:
clg_mjr_sat_17 = pd.read_csv('sat_2019_by_intended_college_major.csv')

In [209]:
clg_mjr_sat_17.head()

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
0,"Agriculture, AgricultureOperations, and Relate...","24,913",1%,977,496,481
1,Architecture and Related Services,"28,988",2%,1047,520,527
2,"Area, Ethnic, Cultural, and Gender Studies","2,629",0%,1040,536,504
3,Biological and Biomedical Sciences,"155,834",8%,1139,572,566
4,"Business, Management, Marketing, and Related S...","221,523",12%,1072,534,537

In [211]:
clg_mjr_sat_17.sort_values('Percent',ascending=False)

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
3,Biological and Biomedical Sciences,"155,834",8%,1139,572,566
37,Undecided,"126,939",7%,1069,538,532
35,"Visual and Performing Arts, General","130,642",7%,1045,536,510
6,Computer and Information Sciences and Support ...,"79,736",4%,1156,571,585
8,Education,"71,882",4%,1022,519,503
31,Security and Protective Services,"68,177",4%,975,495,479
29,"Psychology, General","75,626",4%,1064,546,518
16,"Legal Studies, General","35,788",2%,1104,564,540
5,"Communication, Journalism, and Related Programs","36,332",2%,1069,550,519
1,Architecture and Related Services,"28,988",2%,1047,520,527
10,Engineering Technologies/Technicians,"33,595",2%,1041,512,528
32,Social Sciences,"33,356",2%,1164,594,570
14,Health Professions and related Clinical Sciences,"331,026",18%,1048,529,518
4,"Business, Management, Marketing, and Related S...","221,523",12%,1072,534,537
9,Engineering,"194,127",11%,1139,559,581
27,Physical Sciences,"26,318",1%,1203,597,606
36,Other,"26,888",1%,963,488,476
24,"Parks, Recreation and Leisure Studies","13,039",1%,960,482,478
23,Natural resources and Conservation,"10,147",1%,1104,562,543
0,"Agriculture, AgricultureOperations, and Relate...","24,913",1%,977,496,481
13,"Foreign Languages and Literatures, General","9,936",1%,1102,566,536
15,"History, General","12,611",1%,1090,563,527
11,English Language and Literature/Letters,"16,233",1%,1119,585,533
19,Mathematics and Statistics,"16,508",1%,1242,597,646
17,"Liberal Arts and Sciences, General Studies and...","8,611",0%,1140,584,556
25,"Personal and Culinary Services, General","6,668",0%,929,474,456
26,Philosophy and Religious Studies,"3,381",0%,1120,572,548
18,Library Science/Librarianship,283,0%,1105,577,527
28,Precision Production,319,0%,932,466,466
21,Military Technologies,"7,448",0%,984,498,486
30,Public Administration and Social Service Profe...,"7,852",0%,1001,513,488
12,Family and Consumer Sciences/Human Sciences,"6,469",0%,953,484,469
22,Multi/Interdisciplinary Studies,"2,979",0%,1155,581,574
33,Theology and Religious Vocations,"1,991",0%,1096,561,535
34,Transportation and Materials Moving,"1,105",0%,1019,511,508
7,"Construction Trades, General","2,500",0%,919,459,460
2,"Area, Ethnic, Cultural, and Gender Studies","2,629",0%,1040,536,504
20,Mechanic and Repair Technologies/Technicians,"6,592",0%,916,458,458

In [212]:
clg_mjr_sat_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   IntendedCollegeMajor  38 non-null     object
 1   TestTakers            38 non-null     object
 2   Percent               38 non-null     object
 3   Total                 38 non-null     int64
 4   ReadingWriting        38 non-null     int64
 5   Math                  38 non-null     int64
dtypes: int64(3), object(3)
memory usage: 1.9+ KB

In [216]:
clg_mjr_sat_17.sort_values('Total',ascending=False).head()

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
19,Mathematics and Statistics,"16,508",1%,1242,597,646
27,Physical Sciences,"26,318",1%,1203,597,606
32,Social Sciences,"33,356",2%,1164,594,570
6,Computer and Information Sciences and Support ...,"79,736",4%,1156,571,585
22,Multi/Interdisciplinary Studies,"2,979",0%,1155,581,574

In [215]:
clg_mjr_sat_17.sort_values('TestTakers',ascending=False).head()

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
13,"Foreign Languages and Literatures, General","9,936",1%,1102,566,536
17,"Liberal Arts and Sciences, General Studies and...","8,611",0%,1140,584,556
6,Computer and Information Sciences and Support ...,"79,736",4%,1156,571,585
29,"Psychology, General","75,626",4%,1064,546,518
8,Education,"71,882",4%,1022,519,503

In [219]:
int(('12,500').replace(',','_'))

12500

In [224]:
for x in range(len(clg_mjr_sat_17)):
    clg_mjr_sat_17.loc[x,'TestTakers'] = int((clg_mjr_sat_17.loc[x,'TestTakers']).replace(',','_'))

In [226]:
clg_mjr_sat_17.loc[:,'TestTakers'].head()

0     24913
1     28988
2      2629
3    155834
4    221523
Name: TestTakers, dtype: object

In [230]:
clg_mjr_sat_17.sort_values('TestTakers',ascending=False).head()

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
14,Health Professions and related Clinical Sciences,331026,18%,1048,529,518
4,"Business, Management, Marketing, and Related S...",221523,12%,1072,534,537
9,Engineering,194127,11%,1139,559,581
3,Biological and Biomedical Sciences,155834,8%,1139,572,566
35,"Visual and Performing Arts, General",130642,7%,1045,536,510

In [231]:
clg_mjr_sat_17.sort_values('Total').head()

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
20,Mechanic and Repair Technologies/Technicians,6592,0%,916,458,458
7,"Construction Trades, General",2500,0%,919,459,460
25,"Personal and Culinary Services, General",6668,0%,929,474,456
28,Precision Production,319,0%,932,466,466
12,Family and Consumer Sciences/Human Sciences,6469,0%,953,484,469

In [232]:
clg_mjr_sat_17.sort_values('Total',ascending=False).head()

,IntendedCollegeMajor,TestTakers,Percent,Total,ReadingWriting,Math
19,Mathematics and Statistics,16508,1%,1242,597,646
27,Physical Sciences,26318,1%,1203,597,606
32,Social Sciences,33356,2%,1164,594,570
6,Computer and Information Sciences and Support ...,79736,4%,1156,571,585
22,Multi/Interdisciplinary Studies,2979,0%,1155,581,574

Findings:

ACT 17-19 have the same number of rows but different columns as well as spelling for the overlapping ones<br> 
ACT 17 also has National average<br>

ACT 17 row 51, Composite score is not a float<br>

ACT 17-18, bottom 3 states in Composite score have 100% participation: Nevada, South Carolina, Missippi<br>
ACT 19, bottom 3 states in Composite score have 100% participation: Nevada, Louisiana, Missippi


SAT 19 has additional states Virgin Island and Puerto Rico

SAT 17-19 different number of columns as well as spelling for the overlapping ones

SAT 17 bottom 3 states are Idaho, Delaware, and District Columbia. Idaho has 93% Participation whilst the other 2 states are 100%.<br>
SAT 18 bottom 3 state Distric Columbia (92%), Delaware (100%) and West Virginia (28%).<br>
SAT 19 bottom 5 includes the 2 additional states without participation rates. West Viriginia (99%), Oklahoma (22%) and District of Columbia (94%)<br>
SAT 18 Oklahoma had a participation rate of 8% and was not bottom 5, but in SAT 19, their participation rate was 22% and their average total fell.

Top 5 intended college majors average total score was less than 5 percent in terms of overall test takers per each major, Stats, Physical Science, Social Sciences<br>
Test Taker column not integer<br>
Top 3 popular intended college major are Health, Business and Engineering<br>
3 least popular college majors are Mechanics,Costruction, Culinary, less than 5 percent in terms of overall test takers per each major

In [236]:
sat_18.loc[(sat_18.state == 'Oklahoma')]

       state participation  evidence-based_reading_and_writing  math  total
35  Oklahoma            8%                                 541   521   1062

In [239]:
sat_19.loc[(sat_19.State == 'Oklahoma')]

       State Participation Rate  EBRW  Math  Total
36  Oklahoma                22%   490   472    963

In [240]:
!ls

act_2017.csv                           sat_2018.csv
act_2018.csv                           sat_2019.csv
act_2019.csv                           sat_2019_by_intended_college_major.csv
act_2019_ca.csv                        sat_2019_ca.csv
sat_2017.csv                           sat_act_by_college.csv

In [241]:
sat_19_ca = pd.read_csv('sat_2019_ca.csv')

In [243]:
sat_19_ca.head()

,CDS,CCode,CDCode,SCode,RType,SName,DName,CName,Enroll12,NumTSTTakr12,...,NumERWBenchmark11,PctERWBenchmark11,NumMathBenchmark11,PctMathBenchmark11,TotNumBothBenchmark12,PctBothBenchmark12,TotNumBothBenchmark11,PctBothBenchmark11,Year,Unnamed: 25
0,6.615981e+12,6.0,661598.0,630046.0,S,Colusa Alternative Home,Colusa Unified,Colusa,18.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2018-19,NaN
1,6.616061e+12,6.0,661606.0,634758.0,S,Maxwell Sr High,Maxwell Unified,Colusa,29.0,10.0,...,*,*,*,*,*,*,*,*,2018-19,NaN
2,1.964733e+13,19.0,1964733.0,1930924.0,S,Belmont Senior High,Los Angeles Unified,Los Angeles,206.0,102.0,...,42,24.14,12,6.90,14,13.73,11,6.32,2018-19,NaN
3,1.964733e+13,19.0,1964733.0,1931476.0,S,Canoga Park Senior High,Los Angeles Unified,Los Angeles,227.0,113.0,...,97,35.27,37,13.45,18,15.93,35,12.73,2018-19,NaN
4,1.964733e+13,19.0,1964733.0,1931856.0,S,Whitman Continuation,Los Angeles Unified,Los Angeles,18.0,14.0,...,*,*,*,*,*,*,*,*,2018-19,NaN

In [244]:
sat_19_ca.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2580 entries, 0 to 2579
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   CDS                    2579 non-null   float64
 1   CCode                  2579 non-null   float64
 2   CDCode                 2579 non-null   float64
 3   SCode                  2579 non-null   float64
 4   RType                  2579 non-null   object
 5   SName                  1982 non-null   object
 6   DName                  2521 non-null   object
 7   CName                  2579 non-null   object
 8   Enroll12               2579 non-null   float64
 9   NumTSTTakr12           2579 non-null   float64
 10  NumERWBenchmark12      2304 non-null   object
 11  PctERWBenchmark12      2304 non-null   object
 12  NumMathBenchmark12     2304 non-null   object
 13  PctMathBenchmark12     2304 non-null   object
 14  Enroll11               2579 non-null   float64
 15  NumTSTTakr11           2579 non-null   float64
 16  NumERWBenchmark11      2269 non-null   object
 17  PctERWBenchmark11      2269 non-null   object
 18  NumMathBenchmark11     2269 non-null   object
 19  PctMathBenchmark11     2269 non-null   object
 20  TotNumBothBenchmark12  2304 non-null   object
 21  PctBothBenchmark12     2304 non-null   object
 22  TotNumBothBenchmark11  2269 non-null   object
 23  PctBothBenchmark11     2269 non-null   object
 24  Year                   2579 non-null   object
 25  Unnamed: 25            0 non-null      float64
dtypes: float64(9), object(17)
memory usage: 524.2+ KB

In [245]:
!ls

act_2017.csv                           sat_2018.csv
act_2018.csv                           sat_2019.csv
act_2019.csv                           sat_2019_by_intended_college_major.csv
act_2019_ca.csv                        sat_2019_ca.csv
sat_2017.csv                           sat_act_by_college.csv

In [246]:
sat_act_by_college = pd.read_csv('sat_act_by_college.csv')

In [247]:
sat_act_by_college.head()

,School,Test Optional?,Applies to Class Year(s),Policy Details,Number of Applicants,Accept Rate,SAT Total 25th-75th Percentile,ACT Total 25th-75th Percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,4.3%,1440-1570,32-35
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,4.7%,1460-1580,33-35
2,Princeton University,Yes,2021,Princeton has adopted a one-year test optional...,35370,5.5%,1440-1570,32-35
3,Columbia University,Yes,2021,Columbia has adopted a one-year test optional ...,40203,5.5%,1450-1560,33-35
4,Yale University,Yes,2021,Yale has adopted a one-year test optional poli...,36844,6.1%,1460-1570,33-35

In [248]:
sat_act_by_college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 416 entries, 0 to 415
Data columns (total 8 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   School                          416 non-null    object
 1   Test Optional?                  416 non-null    object
 2   Applies to Class Year(s)        390 non-null    object
 3   Policy Details                  416 non-null    object
 4   Number of Applicants            416 non-null    int64
 5   Accept Rate                     416 non-null    object
 6   SAT Total 25th-75th Percentile  416 non-null    object
 7   ACT Total 25th-75th Percentile  416 non-null    object
dtypes: int64(1), object(7)
memory usage: 26.1+ KB